---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarCurvesData.GetNumberOfBarGeometry
source: html/cd4e016b-6301-31f7-6c37-660a35a6b688.htm
---
# Autodesk.Revit.DB.Structure.RebarCurvesData.GetNumberOfBarGeometry Method

Gets the number of Bar Geometry that were added.

## Syntax (C#)
```csharp
public int GetNumberOfBarGeometry()
```

## Returns
Returns the number of Bar Geometry that were added.